#ifndef __control_H_
#define __control_H_

/*-----------------------------------------引入头文件----------------------------------------------------*/
#include <stdlib.h>
#include <string.h>
#include <stdint.h>

#include <rtthread.h>

#include <board.h>
#include "drv_gpio.h"
/*------------------------------------------------------------------------------------------------------*/



/*-------------------------------------------函数声明----------------------------------------------------*/
//led初始化函数
void led_init(void);
//relay初始化函数
void relay_init(void);
//led0打开函数
void led0_open(void);
//led0关闭函数
void led0_close(void);
//led0翻转函数
void led0_toggle(void);
//led1打开函数
void led1_open(void);
//led1关闭函数
void led1_close(void);
//led1翻转函数
void led1_toggle(void);
//relay打开函数
void relay_open(void);
//relay关闭函数
void relay_close(void);

/*------------------------------------------------------------------------------------------------------*/


#endif

/*********************************************************************************************************
  End Of File
*********************************************************************************************************/
