#ifndef __mq_client_H_
#define __mq_client_H_

/*-----------------------------------------引入头文件----------------------------------------------------*/
#include <stdlib.h>
#include <string.h>
#include <stdint.h>

#include <rtthread.h>
#include "paho_mqtt.h"
#include "cJSON.h"
/*------------------------------------------------------------------------------------------------------*/

#define DBG_ENABLE
#define DBG_SECTION_NAME    "[MQTT] "
#define DBG_LEVEL           DBG_LOG
#define DBG_COLOR

#include <rtdbg.h>

#define MQTT_URI                "tcp://183.230.40.39:6002" // 配置测试服务器地址
#define MQTT_CLIENTID           "520172418"
#define MQTT_USERNAME           "222351"
#define MQTT_PASSWORD           "5d9ff32"
#define MQTT_SUBTOPIC1           "mqtt/#"            	// 设置订阅主题
#define MQTT_SUBTOPIC2           "SYS/#"            		// 设置订阅主题
#define MQTT_PUBTOPIC           "/mqtt/test"            // 设置推送主题
#define MQTT_WILLMSG            "Goodbye!"              // 设置遗言消息

/*-------------------------------------------函数声明----------------------------------------------------*/
/*********************************************************************************************************
**函数描述：mq客户端入口函数
*********************************************************************************************************/
void mq_client_entry(void * parameter);

/*------------------------------------------------------------------------------------------------------*/


#endif

/*********************************************************************************************************
  End Of File
*********************************************************************************************************/
